Title: Настройка окружения Three.js
Description: Как настроить разрабочее окружение для Three.js
TOC: Настройка

Эта статья является частью серии статей о three.js. 
Первая статья - [основы Three.js](threejs-fundamentals.html).
Если вы её еще не читали, советую вам сделать это.

Прежде чем мы пойдем дальше, нам нужно поговорить о настройке вашего компьютера для разработки. 
В частности, по соображениям безопасности WebGL не может напрямую использовать изображения с 
вашего жесткого диска. Это означает, что для разработки вам необходимо использовать веб-сервер. 
К счастью, веб-серверы разработки очень просты в настройке и использовании.

Прежде всего, если вы хотите, вы можете скачать весь этот сайт по [этой ссылке](https://github.com/gfxfundamentals/threejsfundamentals/archive/gh-pages.zip).
После загрузки дважды щелкните по zip-файлу, чтобы распаковать файлы.

Затем загрузите один из этих простых веб-серверов или воспользуйтесь средствами вашего ide

Если вы предпочитаете веб-сервер с пользовательским интерфейсом, есть 
[Servez](https://greggman.github.io/servez)

{{{image url="resources/servez.gif" className="border" }}}

Просто укажите на папку, в которую вы распаковали файлы, нажмите "Start", затем 
перейдите в браузере на [`http://localhost:8080/`](http://localhost:8080/) или, если 
вы хотите просмотреть примеры, перейдите в [`http://localhost:8080/threejs`](http://localhost:8080/threejs).

Чтобы остановить сервер нажмите stop или выйдите из Servez.

Если вы предпочитаете командную строку (как я), еще один способ заключается 
в использовании [node.js](https://nodejs.org).
Загрузите его, установите его, затем откройте окно командной строки / консоли / терминала. 
Если вы работаете в Windows, установщик добавит специальную "Node Command Prompt", используйте ее.

Затем установите [`servez`](https://github.com/greggman/servez-cli) набрав в консоли

    npm -g install servez

Если вы используете OSX

    sudo npm -g install servez

Как только вы сделали это, напишите

    servez path/to/folder/where/you/unzipped/files

Это должно вывести что-то вроде

{{{image url="resources/servez-response.png" }}}

Затем в вашем браузере перейдите на [`http://localhost:8080/`](http://localhost:8080/).

Если вы не укажете путь, тогда http-сервер будет хостить(размещать на сервере) текущую папку.

Если какой-либо из этих вариантов вам не по вкусу,
[есть много других простых серверов на выбор](https://stackoverflow.com/questions/12905426/what-is-a-faster-alternative-to-pythons-servez-or-simplehttpserver).

Теперь, когда вы настроили сервер, мы можем перейти к [текстурам](threejs-textures.html).
